XMLconfiguration/Documents/КомпенсацияПроезд.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Document>
		<Properties>
			<Name>КомпенсацияПроезд</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ВыплатыЛьготникам</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>МесяцВыплаты</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчебныйГод</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УчебныеГода</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Обучающиеся</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Родитель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Родители</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Банк</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Банки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РасчетныйСчет</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>20</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Обучающийся</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Обучающиеся</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Класс</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Классы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УдостоверениеМногодетныхНомер</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>6</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СрокДействия</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

XMLconfiguration/Enums/ПереченьЛьгот.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Enum>
		<Properties>
			<Name>ПереченьЛьгот</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ЕдиноразовоеПитание</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДвухразовоеПитание</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КомпенсацияЗаПроезд</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КомпенсацияЗаОдежду</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СкидкаНаПлатныеУслуги</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

XMLconfiguration/Documents/КомпенсацияПроезд/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаСервере
Процедура ВыводМесяц(Флаг)
	Если Объект.МесяцВыплаты = '00010101' Тогда
		 Объект.МесяцВыплаты = НачалоМесяца(ДобавитьМесяц(Объект.Дата,1)); 
		 Объект.УчебныйГод = ПолучитьУчебныйГод(Объект.МесяцВыплаты);
	КонецЕсли;
	 
	МесяцСтрока = МесяцВСтроку(Месяц(Объект.МесяцВыплаты));
	
	Если Флаг Тогда
		Объект.УчебныйГод = ПолучитьУчебныйГод(Объект.МесяцВыплаты);	
	КонецЕсли;
	Если Объект.Обучающиеся.Количество() > 0 И Флаг Тогда
		Объект.Обучающиеся.Очистить();
		
	КонецЕсли;
	
КонецПроцедуры
 
&НаКлиенте
Процедура МесяцМинус(Команда)    
	Если Объект.МесяцВыплаты <= 1 Тогда
		Объект.МесяцВыплаты = 12;
	ИначеЕсли Объект.МесяцВыплаты > 12 Тогда
		Объект.МесяцВыплаты = 12;
	Иначе
		Объект.МесяцВыплаты = Объект.МесяцВыплаты - 1;
	КонецЕсли; 
	
	ВыводМесяц(Истина);	
КонецПроцедуры

&НаКлиенте
Процедура МесяцПлюс(Команда)
	Если Объект.МесяцВыплаты >= 12 Тогда
		Объект.МесяцВыплаты = 1;
	ИначеЕсли Объект.МесяцВыплаты < 1 Тогда
		Объект.МесяцВыплаты = 1;
	Иначе
		Объект.МесяцВыплаты = Объект.МесяцВыплаты + 1;
	КонецЕсли;
	
	ВыводМесяц(Истина);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ) 
	ВыводМесяц(Ложь);
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьОбучающихся(Команда)
	ЗаполнитьОбучающихсяНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьОбучающихсяНаСервере() 
	Объект.Обучающиеся.Очистить();
	
	
	ЗапросОбучающиеся = Новый Запрос("ВЫБРАТЬ
	                                 |	Движения.Обучающийся КАК Обучающийся,
									 |	Движения.Обучающийся.ДатаРождения КАК ДатаРождения,
	                                 |	Движения.Класс КАК Класс,
	                                 |	Банки.Банк КАК Банк,
	                                 |	Банки.РасчетныйСчет КАК РасчетныйСчет,
	                                 |	УдостоверенияМногодетных.Выдан КАК Родитель,
	                                 |	УдостоверенияМногодетных.НомерУдостоверения КАК НомерУдостоверения,
	                                 |	УдостоверенияМногодетных.СрокДействия КАК СрокДействия
	                                 |ИЗ
	                                 |	РегистрСведений.ДвиженияОбучающихся.СрезПоследних(&Дата, Отчислен = ЛОЖЬ) КАК Движения
	                                 |	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Обучающиеся.Льготы КАК Льготы
	                                 |	ПО Движения.Обучающийся = Льготы.Ссылка
	                                 |	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Обучающиеся.УдостоверениеМногодетных КАК УдостоверенияМногодетных
	                                 |	ПО Движения.Обучающийся = УдостоверенияМногодетных.Ссылка
									 |	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Обучающиеся.БанковскиеРеквизиты КАК Банки
	                                 |	ПО УдостоверенияМногодетных.Выдан = Банки.ВладелецСчета
	                                 |ГДЕ
	                                 |	Льготы.НаименованиеЛьготы = &НаименованиеЛьготы
									 |  И Банки.Актуальный = Истина
									 |  И Льготы.Заявитель = Банки.ВладелецСчета
									 |  И УдостоверенияМногодетных.Актуальное = Истина
	                                 |	И Льготы.Начало <= &ДатаВыплаты
	                                 |	И Льготы.Окончание >= &ДатаВыплаты
	                                 |	И УдостоверенияМногодетных.СрокДействия >= &ДатаВыплаты
									 |  И Движения.Обучающийся.ДатаРождения = УдостоверенияМногодетных.Ссылка.ДатаРождения
									 |	И Движения.Обучающийся.ДатаРождения = Банки.Ссылка.ДатаРождения");
	ЗапросОбучающиеся.УстановитьПараметр("Дата",Объект.Дата);
	ЗапросОбучающиеся.УстановитьПараметр("ДатаВыплаты",Объект.МесяцВыплаты);
	ЗапросОбучающиеся.УстановитьПараметр("НаименованиеЛьготы",Перечисления.ПереченьЛьгот.КомпенсацияЗаПроезд);
	
	Выборка = ЗапросОбучающиеся.Выполнить().Выбрать(); //Все данные по ученикам
	
	Пока Выборка.Следующий() Цикл
		Строка = Объект.Обучающиеся.Добавить();
		Строка.Обучающийся = Выборка.Обучающийся;
		Строка.Класс = Выборка.Класс;
		Строка.Банк = Выборка.Банк;
		Строка.РасчетныйСчет = Выборка.РасчетныйСчет;
		Строка.Родитель = Выборка.Родитель;
		Строка.УдостоверениеМногодетныхНомер = Выборка.НомерУдостоверения;
		Строка.СрокДействия = Выборка.СрокДействия;
	КонецЦикла;
	
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	Если Объект.Обучающиеся.Количество() > 0 Тогда
		Объект.Обучающиеся.Очистить();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура МесяцВыплатыПриИзменении(Элемент)
	ВыводМесяц(Истина);	
КонецПроцедуры
